# Реализовать функцию int_func(),
# принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой.

def int_func (*args):
    word = input("Введите слово из маленьких латинских букв ")
    print(word.title())
    return
int_func()
